# **The Challenge**

The sinking of the Titanic is one of the most infamous shipwrecks in history.

On April 15, 1912, during her maiden voyage, the widely considered “unsinkable” RMS Titanic sank after colliding with an iceberg. Unfortunately, there weren’t enough lifeboats for everyone onboard, resulting in the death of 1502 out of 2224 passengers and crew.

While there was some element of luck involved in surviving, it seems some groups of people were more likely to survive than others.

In this challenge, we ask you to build a predictive model that answers the question: “what sorts of people were more likely to survive?” using passenger data (ie name, age, gender, socio-economic class, etc).

# **Importing Libraries**

In [1]:
import numpy as np
import pandas as pd
from sklearn.metrics import accuracy_score
from sklearn.ensemble import RandomForestClassifier
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

# **Load the training and test dataset**

In [2]:
train = pd.read_csv('./sample_data/train.csv')
test = pd.read_csv('./sample_data/test.csv')

In [3]:
train.head(10)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[10 rows x 12 columns]

In [4]:
test.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

**Data** **Classification**
*   Survived: 0 = No, 1 = Yes*
*   pclas: Ticket class 1 = 1st, 2 = 2nd, 3 = 3rd
*   sibsp: # of siblings / spouses aboard the Titanic
*   parch: # of parents / children aboard the Titanic
*   ticket: Ticket number
*   cabin: Cabin number
*   embarked: Port of Embarkation C = Cherbourg, Q = Queenstown, S = Southampton

In [5]:
train.shape

(891, 12)

In [6]:
test.shape

(418, 11)

In [7]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [8]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [9]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [10]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

**Combining train and test dataset**

In [11]:
train_test_data = [train, test]

**Sex Mapping**

male: 0
female: 1

In [12]:
sex_mapping = {"male": 0, "female": 1}
for dataset in train_test_data:
    dataset['Sex'] = dataset['Sex'].map(sex_mapping)

**Fill missing age of train and test datset with mean age**

In [13]:
train["Age"].fillna(train.Age.mean(), inplace=True)
test["Age"].fillna(test.Age.mean(), inplace=True)

In [14]:
train.head(10)

   PassengerId  Survived  Pclass  ...     Fare  Cabin  Embarked
0            1         0       3  ...   7.2500    NaN         S
1            2         1       1  ...  71.2833    C85         C
2            3         1       3  ...   7.9250    NaN         S
3            4         1       1  ...  53.1000   C123         S
4            5         0       3  ...   8.0500    NaN         S
5            6         0       3  ...   8.4583    NaN         Q
6            7         0       1  ...  51.8625    E46         S
7            8         0       3  ...  21.0750    NaN         S
8            9         1       3  ...  11.1333    NaN         S
9           10         1       2  ...  30.0708    NaN         C

[10 rows x 12 columns]

**Fill missing Fare with mean fare**

In [15]:
train["Fare"].fillna(train.Fare.median(), inplace=True)
test["Fare"].fillna(test.Fare.median(), inplace=True)

In [16]:
train.head()

   PassengerId  Survived  Pclass  ...     Fare  Cabin  Embarked
0            1         0       3  ...   7.2500    NaN         S
1            2         1       1  ...  71.2833    C85         C
2            3         1       3  ...   7.9250    NaN         S
3            4         1       1  ...  53.1000   C123         S
4            5         0       3  ...   8.0500    NaN         S

[5 rows x 12 columns]

# **Feature Engineering**

In [17]:
features_drop = ['Name', 'Ticket', 'Cabin', 'Embarked']
train = train.drop(features_drop, axis=1)
test = test.drop(features_drop, axis=1)

In [18]:
train_data = train.drop('Survived', axis=1)
target = train['Survived']

train_data.shape, target.shape

((891, 7), (891,))

In [19]:
train_data.head(10)

   PassengerId  Pclass  Sex        Age  SibSp  Parch     Fare
0            1       3    0  22.000000      1      0   7.2500
1            2       1    1  38.000000      1      0  71.2833
2            3       3    1  26.000000      0      0   7.9250
3            4       1    1  35.000000      1      0  53.1000
4            5       3    0  35.000000      0      0   8.0500
5            6       3    0  29.699118      0      0   8.4583
6            7       1    0  54.000000      0      0  51.8625
7            8       3    0   2.000000      3      1  21.0750
8            9       3    1  27.000000      0      2  11.1333
9           10       2    1  14.000000      1      0  30.0708

# **Model: Ramdom Forest**

In [20]:
model = RandomForestClassifier(n_estimators= 113)

y_pred = model.fit(train_data, target)

In [21]:
print('Traing Accuracy: ', accuracy_score(target, model.predict(train_data)))

Traing Accuracy:  1.0

# **Testing**

In [22]:
prediction = model.predict(test)

In [23]:
submission = pd.DataFrame({
        "PassengerId": test["PassengerId"],
        "Survived": prediction
    })

submission.to_csv('submission.csv', index=False)

In [24]:
submission = pd.read_csv('submission.csv')
submission.head(30)

    PassengerId  Survived
0           892         0
1           893         0
2           894         0
3           895         0
4           896         0
5           897         0
6           898         0
7           899         0
8           900         1
9           901         0
10          902         0
11          903         0
12          904         1
13          905         0
14          906         1
15          907         1
16          908         0
17          909         0
18          910         0
19          911         0
20          912         1
21          913         1
22          914         1
23          915         1
24          916         1
25          917         0
26          918         1
27          919         0
28          920         1
29          921         0